//alert("นี่คือบทเรียน java script ทั้งหมด");
// document.write("<h1>JAVA SCRIPT</h1>");
// ----------------------------------------------------------------------------------------------------------------------------------
// การสร้างตัวแปร
let name ="Zen";
console.log(name);
// ----------------------------------------------------------------------------------------------------------------------------------
// การแปลงชนิดข้อมูล
let value1 = "5"; // string
let value2 = 10;  // number
// แปลง string เป็น number
console.log(Number(value1) + value2);
// แปลง number เป็น string
console.log(value1 + String(value2));
// ----------------------------------------------------------------------------------------------------------------------------------
// การใช้ array
let fruits = ["Apple", "Banana", "Cherry"];
console.log(fruits[0]); // แสดงผล "Apple"